{
    "ES6" : {
        "O que é" : "É a versão atualizada do JavaScript, vem com novas features e maneiras diferentes de se trabalhar"
    },
    "scope" : "Scope ou escopo se refere a área em que o elemento existe e pode atuar, esta área é definida pelas  {bloco} as quais chamamos de bloco.",
    "var" : "Definidor de variável com escopo GLOBAL.",
    "let" : "Definidor de variável com escopo de bloco.",
    "const" : "Definidor de constante com escopo de bloco. Obs: Objetos mesmo definidos como const podem ter seus VALORES reatribídos.",
    "Object.freeze(obj)" : "Método para deixar objetos totalmente imutáveis.",
    "Arrow Functions" : "É uma nova sintase para a criação de funções no javaScript.",
    "Default Parameters" : "Permite definir um valor padrão para os parâmetros, para o caso de não ser informado na chamada da função.",
    "Rest Parameters" :  "Uma nova forma de pegar valores passados a mais em uma função.",
    "Spread Operator" : "Maneira mais simples de desmembrar vetores sem precisar iterálos...String é um tipo de vetor.",
    "Template Literal" : "Nova forma de declaração de strings, permite a interpolação de expressões junto a String",
    "Tagged Template" : "É a maneira de passar Templates Literal para uma função, a função recebe um primeiro valor com um array com somente as Strings do Template Literal e os valores seguintes são as expressões interpoladas no Template Literal",
    "Raw String" : "Básicamente permite escrever uma String sem que eles surtam efeito, uma outra característica é fazer o efeito contrário da Tagged Template",
    "Property Shorthand" : "Sintaxe mais curta para a definição de propriedade de objetos com nome similares",
    "Computed Property names" : "Permite definir o nome de uma propriedade de um objeto com base no retorno de uma função",
    "Method Properties" : "Permite criar uma espécie de 'protótipo de função ou interface' dentro de um objeto, este após a criação pode ser sobrescrito para só então funcionar como uma função",
    "Array Matching" : "Permite desestruturar um array em variáveis de forma simples e intuitiva",
    "Object Matching" : "Forma simples de passar valores de um objeto para uma variável ou para outros objetos",
    "Object And Array Matching, Default Values" : "permite aplicar o Destructuring Assignment e caso o valor não seja preenchido a variável recebe um valor padrão",
    "Fail-Soft Destructuring" : "Provocar a falha de um descructuring propositalmente",
    "Parameter Context Matching" : "Permite aplicar todos os conceitos do destructuring nos parâmetros de funções",
    "export" : "Palavra reservada para fazer exportação de môdulos",
    "import" : "Palavra reservada para fazer importação de môdulos",
    "re-export" : "Maneira simples de se fazer a importação e exportação de diferentes môdulos, se utiliza da palavra reservada export"
}